from colorama import init, Fore, Back, Style
init()

yüzüncüYıl = """
           :=+:                .-=++****++=-.             .-=++****++=-.
       :=*#####*-           -+################+-.     .-*################+-
   :=*##########%#-      .+######################+. :+#########*=-:.....:-+*+.
:*##############%%%     +%%######################=.+########*-              .--
 +##############%%%   :#%%%#######*+====+*######::########*:                   .
  =#############%%%  :#%%%%#####-.         -*##::########=
   -#*=:+#######%%%  #%%%%%###=              -=.########=                        -+
        =#######%%% -%%%%%%##=                 =########                         -##-:-++.
        =#######%%% +%%%%%%##                  *#######+                      :-=*#####-
        =#######%%% +%%%%%%##                  ########=                     .:-+*#####-
        =#######%%% -%%%%%%##-                -########=                         -##--=*+
        =#######%%%  #%%%%%###-              -#########.:                        -*. 
        =#######%%%  :%%%%%####*:          :+#########:=#-
        =#######%%%   :#%%%#######*=----=+###########--###+.                   .
        =#######%%%    .*%%########################*:+%#####+:               :-.
        =#######%%%      :*######################*: :#%########+-:.     .:=++:
        =########=.        .=*################*=.     :=#################*-.
        =#####+:               :-=+**##**++-:            .:-++**##**+=-:
        =##*-
        ==.
"""

mesaj = "TÜRKİYE CUMHURİYETİ'NİN YÜZÜNCÜ YILI KUTLU OLSUN!"

# Yüzüncü yıl metninin en uzun satırının uzunluğu
yyEnUzunSatırUzunluk = 0
for satır in yüzüncüYıl.splitlines():
	if len(satır) > yyEnUzunSatırUzunluk:
		yyEnUzunSatırUzunluk = len(satır)

# Mesajı ortalamak için gereken boşluk
boşluk = int(yyEnUzunSatırUzunluk / 2) - int(len(mesaj) / 2)

# Ekrana bas
print(Fore.RED + yüzüncüYıl)
print(Fore.WHITE + boşluk * " " + mesaj)

print(Style.RESET_ALL)
